Revit.Elements.TextNoteType
A Revit TextNoteType

Revit.Elements.TextNoteType.InternalTextNoteType
Internal reference to the Revit Element

Revit.Elements.TextNoteType.InternalElement
Reference to the Element

Revit.Elements.TextNoteType.#ctor(Autodesk.Revit.DB.TextNoteType)
Construct from an existing Revit Element
type:

Revit.Elements.TextNoteType.InitTextNoteType(Autodesk.Revit.DB.TextNoteType)
Initialize a ModelTextType element
type:

Revit.Elements.TextNoteType.InternalSetTextNoteType(Autodesk.Revit.DB.TextNoteType)
Set the internal Element, ElementId, and UniqueId
type:

Revit.Elements.TextNoteType.ByName(System.String)
Select a ModelTextType from the current document by name
name:
Returns:

Revit.Elements.TextNoteType.Default
Return a default TextNoteType
Returns:

Revit.Elements.TextNoteType.FromExisting(Autodesk.Revit.DB.TextNoteType,System.Boolean)
Create from an existing Revit element
modelTextType:
isRevitOwned:
Returns: